package com.siwuxie095.concurrent.chapter5th.example1st;

/**
 * @author Jiajing Li
 * @date 2020-09-17 08:41:30
 */
public class Main {

    /**
     * 并行模式与算法
     *
     * 由于并行程序设计比串行程序复杂得多。因此，应该去熟悉和了解一些常见的设计方法。就好像练习武术一样，一招一式
     * 都是要经过练习的。如果乱打一气，效果不见得好。前人会总结一些武术套路，对于初学者来说，不需要发挥自己的想象
     * 力，只要按照武术套路出拳就可以了（也就是站在巨人的肩膀上）。等练到了一定的高度，就可以以无招胜有招，而不必
     * 拘泥于套路了。这些武术套路和招数，对应到软件开发中来，就是设计模式和算法。这些设计模式和算法都是前人的经验
     * 总结和智慧结晶。在熟知其思想和原理的基础上，再根据自己的需求进行扩展，可能会达到更好的效果。
     */
    public static void main(String[] args) {

    }

}
